class NewMedicalModel{
List ma0=[
  {
    "name": "مستشفى اندلسية سموحة",
    "address": "35 ش د/ بهاء الدين غتورى تقاطع ش/ سيد فهمى - سموحة",
    "phone1": "16781",
    "lat": "29.9069896",
    "long": "31.2164367",
    "phone2": "34275724",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "مستشفى اندلسية الشلالات",
    "address": "7شارع محمد مطاوع – الشلالات - الاسكندرية",
    "phone1": "34880900",
    "lat": "29.9665011",
    "long": "31.2044367",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفي القوات المسلحه بالاسكندرية \"مصطفى كامل العسكرى \"",
    "address": "جمب المنطقة الشمالية العسكرية بعد محطة ترام  -سيدي جابر",
    "phone1": "35448858",
    "lat": "31.2256825",
    "long": "29.9385909",
    "phone2": "35452013",
    "phone3": "0"
  },
  {
    "name": "مستشفى الاقبال",
    "address": "10 ش حسين امين متفرع من شارع السرايا الاقبال",
    "phone1": "33571691",
    "lat": "29.9734365",
    "long": "31.251598",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفى البترول",
    "address": "68 ش فلمنج الاسكندرية",
    "phone1": "35847816",
    "lat": "29.9605563",
    "long": "31.2343916",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مركز للأوردة",
    "address": "8ش كلية الطب /محطة الرمل/ ميديكال تاو I-VEIN ر",
    "phone1": "34808060",
    "lat": "31.2007928",
    "long": "29.8998614",
    "phone2": "1140777970",
    "phone3": "0"
  },
 {
    "name": "مستشفي إيليت",
    "address": "مدخل الطرق الدائري-بعد مدخل الداون تاون-إسكندرية",
    "phone1": "15461",
    "lat": "31.1737775",
    "long": "29.9303684",
    "phone2": "0",
    "phone3": "0"
  }
];
List ma1=[
  {
    "name": "معمل المختبر",
    "address": "عمر لطفي العطارين",
    "phone1": "19014",
    "lat": "31.2008019",
    "long": "29.8998614",
    "phone2": "0",
    "phone3": "0",
    "undefined": "29.8998614"
  },
  {
    "name": "معمل المختبر",
    "address": "22ش أمين فكرى-ميدان محطة الرمل-العطاين-إسكندرية",
    "phone1": "34812305",
    "lat": "29.8676671",
    "long": "31.202178",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل المختبر",
    "address": "43ش الجلاء، فيكتوريا، الاسكندرية",
    "phone1": "35252366",
    "lat": "29.9220764",
    "long": "31.2362915",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل المختبر",
    "address": "17محمد بن سعد، المندرة بحري، قسم ثان المنتزة، الإسكندري",
    "phone1": "35802166",
    "lat": "29.9778679",
    "long": "31.2853287",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل المختبر",
    "address": "شارع بورسعيد، سيدي جابر، الإسكندري",
    "phone1": "35223174",
    "lat": "29.9220763",
    "long": "31.2367033",
    "phone2": "0",
    "phone3": "0",
    "undefined": "0ة"
  },
  {
    "name": "معمل البرج",
    "address": "74 أمين حسونة، السيوف قبلي (تشمل عزبة دربا قسم ثان المنتزة، الإسكندرية",
    "phone1": "35273061",
    "lat": "29.9226393",
    "long": "31.2376504",
    "phone2": "0",
    "phone3": "74",
    "undefined": "0"
  },
  {
    "name": "معمل البرج",
    "address": "14ش كلية الطب – محطة الرمل",
    "phone1": "19911",
    "lat": "29.9491379",
    "long": "31.2336612",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "شارع الايمان (شارع همام)، العجمي البحري، قسم الدخيلة، الإسكندرية",
    "phone1": "33345988",
    "lat": "31.105723",
    "long": "29.7794543",
    "phone2": "0",
    "phone3": "0"
  }
];
List ma2=[
  {
    "name": "مركز الاسكندرية للعيون",
    "address": "64 شارع اسماعيل مصطفي –ميدان عيون اسكندرية سموحة",
    "phone1": "34244332",
    "lat": "31.2101258",
    "long": "29.9416612",
    "phone2": "34244262",
    "phone3": "0"
  }
];
List ma3=[
  {
    "name": "امريكان دانتل كير",
    "address": "الاسكندرية – العصافرة جمال عبد الناصر –عمارة الشرق فوق يونيون اير",
    "phone1": "1012121279",
    "lat": "31.2741477",
    "long": "30.003145",
    "phone2": "35480318",
    "phone3": "0"
  }
];
List ma4=[
  {
    "name": "مركز دارالاشعة",
    "address": "4ش امين فكري – محطة الرمل",
    "phone1": "1012121279",
    "lat": "31.1999315",
    "long": "29.9005364",
    "phone2": "34878021",
    "phone3": "0"
  }
];
List ma5= [
  {
    "name": "صيدليات سيف",
    "address": "22 ش سوريا -رشدى",
    "phone1": "35445103",
    "lat": "31.2244086",
    "long": "29.9343976",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدليات مستشفى السلامة",
    "address": "الازاريطة – الشلالات",
    "phone1": "16781",
    "lat": "31.2065935",
    "long": "29.9133628",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "شركة الأجزاخانة",
    "address": "جميع الافرع بالقاهرة والاسكندرية",
    "phone1": "16343",
    "lat": "29.9152769",
    "long": "31.2322409",
    "phone2": "0",
    "phone3": "0"
  }
];
  List mc0=[
    {
      "name": "مستشفى دار الفؤاد",
      "address": "6 اكتوبر امتداد ش 26 يوليو",
      "phone1": "16370",
      "lat": "29.9974123",
      "long": "30.9651409",
      "phone2": "16278",
      "phone3": "0"
    },
    {
      "name": "مستشفى دار الفؤاد",
      "address": "مدينة نصر – تقاطع النصر مع شارع يوسف",
      "phone1": "16370",
      "lat": "30.0656422",
      "long": "31.3177889",
      "phone2": "16278",
      "phone3": "238247247"
    },
    {
      "name": "وادى النيل",
      "address": "ش وادى النيل خلف قصر القبة",
      "phone1": "19303",
      "lat": "30.0995129",
      "long": "31.2929519",
      "phone2": "224562711",
      "phone3": "224562713"
    },
    {
      "name": "مستشفى دار الحكمة",
      "address": "10 ش دكتور محمد حسين هيكل مدينة نصر",
      "phone1": "226739050",
      "lat": "30.0658426",
      "long": "31.3358753",
      "phone2": "1066640202",
      "phone3": "0"
    },
    {
      "name": "مستشفى كليوباتر",
      "address": "39 شارع كليوباترا –الماظة –مصر الجديدة",
      "phone1": "1275117431",
      "lat": "31.2289984",
      "long": "29.9842636",
      "phone2": "0",
      "phone3": "0"
    },
    {
      "name": "النيل بدراوي",
      "address": "كورنيش النيل –المعادي",
      "phone1": "225240022",
      "lat": "29.9826364",
      "long": "31.2289984",
      "phone2": "0",
      "phone3": "0"
    },
    {
      "name": "القاهرة التخصصي",
      "address": "روكسي –ش  محمد نافع –المنترة –مصر الجديدة",
      "phone1": "1282865370",
      "lat": "30.0943786",
      "long": "31.2475929",
      "phone2": "0",
      "phone3": "0"
    },
    {
      "name": "الشروق",
      "address": "ش بحر الغزال منفرع من ش احمد عرابي –المهندسين –الجيزة",
      "phone1": "233044901",
      "lat": "31.1970412",
      "long": "30.0686293",
      "phone2": "0",
      "phone3": "0"
    },
    {
      "name": "المركز الطبى العالمى",
      "address": "42 طريق مصر اسماعلية الصحراوى",
      "phone1": "224775902",
      "lat": "30.1862303",
      "long": "31.6250247",
      "phone2": "16221",
      "phone3": "0"
    },
    {
      "name": "المركز الطبي للمقاولون العرب",
      "address": "الجبل الاخضر–بجوار نادي السكة الحديد –مدينة نصر",
      "phone1": "19660",
      "lat": "30.0541945",
      "long": "31.2943404",
      "phone2": "0",
      "phone3": "0"
    },
    {
      "name": "مستشفى الجوى التخصصى",
      "address": "التجمع الخامس –ش90",
      "phone1": "0",
      "lat": "30.0175001",
      "long": "31.4318883",
      "phone2": "19448",
      "phone3": "226176981"
    },
    {
      "name": "المستشفى السعودى الالمانى",
      "address": "القاهرة –47 النزهه الجديده",
      "phone1": "16259",
      "lat": "30.1328037",
      "long": "31.3824842",
      "phone2": "226252400",
      "phone3": "0"
    },
    {
      "name": "مستشفي اندلسية المعادي",
      "address": "القطعة 4ج/6 - تقسيم المعادي- المعادى الجديدة",
      "phone1": "225036100",
      "lat": "29.973177",
      "long": "31.2797833",
      "phone2": "16781",
      "phone3": "0"
    },
    {
      "name": "مستشفى الماسة",
      "address": "26 ش متولي الشعراوي - الحي العاشر –مدينة نصر-القاهرة",
      "phone1": "0",
      "lat": "30.0532087",
      "long": "31.3769156",
      "phone2": "223575162",
      "phone3": "1141664095"
    },
    {
      "name": "مستشفي الجوي العام",
      "address": "ش أحمد سعيد – العباسية- القاهرة",
      "phone1": "226832321",
      "lat": "30.0628337",
      "long": "31.2724651",
      "phone2": "226832328",
      "phone3": "0"
    },
    {
      "name": "المجمع الطبي للقوات المسلحة بالمعادي",
      "address": "المعادي - القاهرة",
      "phone1": "225256345",
      "lat": "29.9677263",
      "long": "31.2411451",
      "phone2": "225256350",
      "phone3": "225256347"
    },
    {
      "name": "مركز القاهرة للقلب والصدر ا.د / محسن فهمى",
      "address": "17 ش الاهرام –روكسى- امام سينما نورماندي",
      "phone1": "224145146",
      "lat": "30.0919451",
      "long": "31.3201352",
      "phone2": "224145147",
      "phone3": "224145145"
    },
    {
      "name": "المركز الطبي للعاملين بقطاع البترول",
      "address": "ش مستشفى البترول متفرع من ش مكرم عبيد –مدينة نصر –القاهرة",
      "phone1": "222715643",
      "lat": "30.0647496",
      "long": "31.3442003",
      "phone2": "223490323",
      "phone3": "0"
    },
    {
      "name": "عيادات سبيد ( جميع التخصصات)",
      "address": "22 شارع نهرو –خلف الميرلاند –روكسي –مصر الجديدة",
      "phone1": "19358",
      "lat": "30.0984646",
      "long": "31.3148942",
      "phone2": "1221898885",
      "phone3": "0"
    },
    {
      "name": "مركز للاوردةI VEIN",
      "address": "شارع 90– التجمع الخامس – خلف المستشفى الجوي التخصصي",
      "phone1": "224061175",
      "lat": "30.0207882",
      "long": "31.4320674",
      "phone2": "1110060088",
      "phone3": "0"
    },
{
      "name": "مستشفي العربي",
      "address": "7 شارع جزيرة بدران-شبرا",
      "phone1": "0225799211",
      "lat": "30.0653941",
      "long": "31.2414212",
      "phone2": "0",
      "phone3": "0"
    },
{
      "name": "عيادات الأمل التخصصية",
      "address": "مسجد الرحمن الرحيم صلاح سالم امام إدارة المركبات",
      "phone1": "19444",
      "lat": "30.0355727",
      "long": "31.0666065",
      "phone2": "0",
      "phone3": "0"
    }
  ];
List mc1=[
  {
    "name": "العيون الدولى",
    "address": "الدقى 14 ش عادل حسين رستم",
    "phone1": "19650",
    "lat": "30.0435683",
    "long": "31.2162153",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "العيون الدولى",
    "address": "مصر الجديده 21 ش الاندلس خلف حديقه الميرلاند  روكسى",
    "phone1": "19650",
    "lat": "30.0989458",
    "long": "31.3149307",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "المركز التخصصي للعيون",
    "address": "18 شارع خليفة المامون –مصر الجديدة",
    "phone1": "19980",
    "lat": "30.0870133",
    "long": "31.3012085",
    "phone2": "224549570",
    "phone3": "0"
  },
  {
    "name": "مراكز القاهرة لجراحه العيون د. امير الشرباصي",
    "address": "شارع الميرغني – مصر الجديده",
    "phone1": "1010868686",
    "lat": "30.1146611",
    "long": "31.3142454",
    "phone2": "1060060090",
    "phone3": "12224463320"
  },
  {
    "name": "مستشفى الرواد للعيون",
    "address": "39 شارع إيران خلف مسجد اسد بن الفرات –الدقي - الجيزة",
    "phone1": "19635",
    "lat": "31.2050845",
    "long": "30.0384847",
    "phone2": "0",
    "undefined": "0"
  },
  {
    "name": "المستشفى الوطني للعيون",
    "address": "211 ش الحجاز- مصر الجديدة",
    "phone1": "226786900",
    "lat": "30.1147414",
    "long": "31.3493655",
    "phone2": "226966000",
    "phone3": "226247575"
  }
];

List mc2=[
  {
    "name": "مركز عبد العزيز علما",
    "address": "75 شارع محمد حسين هيكل الموازى لعباس العقاد –مدينه نصر",
    "phone1": "1112511789",
    "lat": "30.0577191",
    "long": "31.3364909",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مركز كايرو سنتر للعلاج الطبيعي",
    "address": "8 شارع احمد قاسم جوده خلف ماكدونلدز-عباس العقاد",
    "phone1": "1005105249",
    "lat": "30.0601816",
    "long": "31.3362828",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مركز أبو زهرة للعلاج الطبيعي",
    "address": "الفرع الاول - المهندسين –15 ش احمد عرابي-اعلى صيدلية نورماندي",
    "phone1": "1144004080",
    "lat": "30.0627404",
    "long": "31.204765",
    "phone2": "1006020209",
    "phone3": "1000409991",
    "undefined": "0"
  },
  {
    "name": "مركز أبو زهرة للعلاج الطبيعي",
    "address": "الفرع الاول-الفرع الثاني- التجمع الخامس –ميديكال بارك بريمير–شارع التسعيين",
    "phone1": "1111691212",
    "lat": "30.0305704",
    "long": "31.4532038",
    "phone2": "1006020209",
    "phone3": "1000409991",
    "undefined": "1144004080"
  },
{
    "name": "مركز الطب الطبيعي و التأهيلي و علاج الروماتيزم",
    "address": "العجوزة-حي العجوزة -الجيزة",
    "phone1": "0233032227",
    "lat": "30.0544409",
    "long": "31.2104207",
    "phone2": "0",
    "phone3": "0"
  }
];
List mc3= [
  {
    "name": "مركز مناظير وجراحات الانف والاذن والحنجرة",
    "address": "123 ش المامون –امام النادي الاهلي –مدينة نصر",
    "phone1": "223546836",
    "lat": "30.0695149",
    "long": "31.3532726",
    "phone2": "0",
    "phone3": "0"
  }
];
List mc4=[
  {
    "name": "سما كلينك للاسنان",
    "address": "دقى المهندسين",
    "phone1": "233034985",
    "lat": "31.2049912",
    "long": "30.0542752",
    "phone2": "233034985",
    "phone3": "0"
  },
  {
    "name": "سما كلينك للاسنان",
    "address": "6 اكتوبر ( التقاطع لثامن )",
    "phone1": "238368588",
    "lat": "30.0444547",
    "long": "30.9858645",
    "phone2": "224184905",
    "phone3": "233034985",
    "undefined": "0"
  },
  {
    "name": "عيادة دكتور/عبدالله السيد",
    "address": "جميع الفروع",
    "phone1": "01200490030",
    "lat": "30.0319843",
    "long": "31.405387",
    "phone2": "01223645533",
    "phone3": "012004900060"
  },
{
    "name": "المركز التخصصي للأسنان",
    "address": "التجمع الخامس",
    "phone1": "01128093330",
    "lat": "30.019536",
    "long": "31.4338153",
    "phone2": "0",
    "phone3": "0"
  },
{
    "name": "د/أحمد طه مختار",
    "address": "219 ( الدور الأول خلف المستشفي
الجوي",
    "phone1": "0228124219",
    "lat": "30.0175187",
    "long": "31.4319559",
    "phone2": "0",
    "phone3": "0"
  },
{
    "name": "Dental white د/ أسامة خليفة ",
    "address": "المركز الطبي الأول بالرحاب عيادة رقم 207",
    "phone1": "01285620620",
    "lat": "30.0433737",
    "long": "31.4473205",
    "phone2": "0220299920",
    "phone3": "0"
  },
{
    "name": "I smile dental center ",
    "address": "25 شارع أحمد تيسير – مدينة نصر",
    "phone1": "01111794065",
    "lat": "30.081417",
    "long": "31.3248533",
    "phone2": "0",
    "phone3": "0"
  },
{
    "name": "عيادات حياة لطب الأسنان ",
    "address": "مصر الجديدة-التجمع الخامس",
    "phone1": "01203767777",
    "lat": "30.1159893",
    "long": "31.3396925",
    "phone2": "01062436695",
    "phone3": "01202633116"
  },
];

List mc5= [
  {
    "name": "صيدليات سيف",
    "address": "جميع الافرع",
    "phone1": "19199",
    "lat": "30.0690721",
    "long": "31.3423351",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدليات الطرشوبى",
    "address": "ش طريق العروبة –مساكن الشيراتون",
    "phone1": "222676690",
    "lat": "30.1054186",
    "long": "31.3669923",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدلية الزغبى",
    "address": "65 ش عباس العقاد م الاولى بلوك 72 قطعة 2 مدينة نصر",
    "phone1": "19600",
    "lat": "30.0547569",
    "long": "31.3358463",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدلية شيرين",
    "address": "32 شارع عطيه الصوالحي –المنطقة الثامنه مدينة نصر",
    "phone1": "222874993",
    "lat": "30.0519504",
    "long": "31.3482442",
    "phone2": "226711847",
    "phone3": "0"
  },
  {
    "name": "شركة الأجزاخانة",
    "address": "جميع الافرع بالقاهرة والاسكندرية",
    "phone1": "1010466665",
    "lat": "30.0628525",
    "long": "31.2047442",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدلية حسام الطنبولي",
    "address": "42ش ذاكر حسين الحي السابع مدينة نصر",
    "phone1": "223897400",
    "lat": "30.0965026",
    "long": "31.314865",
    "phone2": "0",
    "phone3": "0"
  },
{
    "name": "صيدلية د/ وليد شوقي",
    "address": "8 ش الفريق محمد ابراهيم متفرع من
حسنين هيكل امام المدرسة التجربية
المنطقة السادسة – م.نصر",
    "phone1": "01003445947",
    "lat": "30.0565662",
    "long": "31.3394876",
    "phone2": "0226714922",
    "phone3": "0226702389"
  },
{
    "name": "صيدلية البانوراما",
    "address": "7
شارع النزهة مدينة نصر",
    "phone1": "0222907804",
    "lat": "30.092575",
    "long": "31.3411807",
    "phone2": "0224176675",
    "phone3": "0"
  },
{
    "name": "صيدلية د/ رانيا عراقي",
    "address": "مدينة نصر – 29 ش عبد الرحمن صدقي",
    "phone1": "01090395944",
    "lat": "30.0570328",
    "long": "31.3396369",
    "phone2": "0",
    "phone3": "0"
  }
];
List mc6=[
  {
    "name": "معمل المختبر",
    "address": "جميع الافرع",
    "phone1": "19014",
    "lat": "30.1062747",
    "long": "31.3659805",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "جميع الافرع",
    "phone1": "19911",
    "lat": "30.0525371",
    "long": "31.3439434",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مركز كايرو لاب للتحاليل الطبية",
    "address": "جميع الافرع",
    "phone1": "19962",
    "lat": "30.0532769",
    "long": "31.3352538",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معامل الانصارى",
    "address": "جميع الافرع",
    "phone1": "19324",
    "lat": "30.1003047",
    "long": "31.3416709",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل لايف لاب",
    "address": "جميع الافرع",
    "phone1": "227955847",
    "lat": "30.0190152",
    "long": "31.2127868",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل الفا لاب",
    "address": "جميع الافرع",
    "phone1": "16191",
    "lat": "30.0490366",
    "long": "31.3761213",
    "phone2": "0",
    "phone3": "0"
  }
];
List mc7=[
  {
    "name": "الفا سكان",
    "address": "جميع الافرع",
    "phone1": "16171",
    "lat": "30.0840716",
    "long": "31.3256589",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "تكنو سكا",
    "address": "جميع الافرع",
    "phone1": "19989",
    "lat": "30.0944143",
    "long": "31.3295648",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مركز مصر للآشعة",
    "address": "8 ش الخليفة المأمون –مصر الجديدة",
    "phone1": "19773",
    "lat": "30.0869214",
    "long": "31.3000229",
    "phone2": "0",
    "phone3": "0"
  }
 {
    "name": "مركز الطاهرة للآشعة",
    "address": "51 شارع بورسعيد – السيدة زينب -
القاهرة",
    "phone1": "19173",
    "lat": "30.0339223",
    "long": "31.2444292",
    "phone2": "0223952266",
    "phone3": "0"
  }
];
List md0=[
  {
    "name": "المركز التخصصى للقلب والجهاز الهضمى",
    "address": "الاعصر - بجوار مستشفى الاعصر",
    "phone1": "572349450",
    "lat": "31.4372393",
    "long": "31.8000993",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفى السلام بدمياط",
    "address": "شارع عبد الرحيم نافع-امام مسجد المظلوم",
    "phone1": "573337750",
    "lat": "31.4101953",
    "long": "31.7926134",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفى الشروق",
    "address": "دمياط الجديدة – المنطقة المركزية – خلف كلية تربية",
    "phone1": "1004242225",
    "lat": "31.4175376",
    "long": "31.7969338",
    "phone2": "572406385",
    "phone3": "0"
  },
  {
    "name": "معهد اورام دمياط",
    "address": "الاعصر بجوار مستشفى التخصصى",
    "phone1": "1008769495",
    "lat": "31.4377198",
    "long": "31.8000372",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفى الصفا",
    "address": "كورنيش النيل –السنانية –الكوبرى العلوى",
    "phone1": "572183302",
    "lat": "31.4245568",
    "long": "31.7997256",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفي دار الحياة",
    "address": "دمياط الجديدة – الحي الثاني المجاورة الثانية بجوار كلية التربية النوعية",
    "phone1": "572401690",
    "lat": "31.4478621",
    "long": "31.6890571",
    "phone2": "1022278934",
    "phone3": "0"
  },
  {
    "name": "مستشفى دمياط العسكري",
    "address": "دمياط الجديدة – المنطقة المركزية",
    "phone1": "572402556",
    "lat": "31.4402679",
    "long": "31.6892495",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفى ابن سينا التخصصي",
    "address": "تفتيش كفر سعد – ش الجمهورية",
    "phone1": "1111238344",
    "lat": "31.3560039",
    "long": "31.6813993",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفي العاصمة",
    "address": "دمياط الجديدة-الحي الخامس-منطقة المستثمر الصغير أمام جامعة دمياط",
    "phone1": "01030030710",
    "lat": "31.4305181",
    "long": "31.6436867",
    "phone2": "01200848300",
    "phone3": "0572081111"
  }
];
List md1=[
  {
    "name": "مركز دمياط سكان للاشعة",
    "address": "شارع صلاح سالم -  بجوار مدرسة التجارة الثانوية بنات - خلف مصنع الغزل والنسي",
    "phone1": "572355588",
    "lat": "31.4106073",
    "long": "31.803845",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مركز الايمان للاشعة",
    "address": "دمياط - ش عبد الرحيم نافع- خلف مسجد الظلوم",
    "phone1": "572245296",
    "lat": "31.4086002",
    "long": "31.8096457",
    "phone2": "16961",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "مركز تكنوسكان للاشعة التشخيصية",
    "address": "دمياط -  شارع عبدالرحيم نافع",
    "phone1": "572230140",
    "lat": "31.408191",
    "long": "31.8127036",
    "phone2": "19989",
    "phone3": "0",
    "undefined": "0"
  },
{
    "name": "مركز ثقة للأشعة",
    "address": "دمياط الجديدة-منتصف شارع المحجوب",
    "phone1": "01092297509",
    "lat": "31.4333931",
    "long": "31.6812358",
    "phone2": "0",
    "phone3": "0"
  }
];
List md2=[
  {
    "name": "معمل المختبر",
    "address": "شارع  عمر افندى-امام قصر الثقافة بجوار بنك جنرال سوستية  دمياط",
    "phone1": "19014",
    "lat": "31.414737",
    "long": "31.8083358",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل المختبر",
    "address": "دمياط الجديده شارع الصعيدي",
    "phone1": "19014",
    "lat": "31.4440771",
    "long": "31.6808165",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "سيتى لاب",
    "address": "جميع الفروع",
    "phone1": "19358",
    "lat": "31.418408",
    "long": "31.8169693",
    "phone2": "1200220834",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "مول الصفوة دمياط",
    "phone1": "19911",
    "lat": "31.4142741",
    "long": "31.7974464",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "مول الصفوة دمياط الجديدة",
    "phone1": "19911",
    "lat": "31.4432876",
    "long": "31.6812262",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل ميترا",
    "address": "شارع  عمر افندى- برج التطبيقيين -امام قصر الثقافة بجوار بنك جنرال سوستية  دمياط",
    "phone1": "572226080",
    "lat": "31.413958",
    "long": "31.8082607",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل ميترا",
    "address": "دمياط الجديدة – شارع الكفراوي",
    "phone1": "572226080",
    "lat": "31.4436918",
    "long": "31.6810874",
    "phone2": "0",
    "phone3": "0"
  },
{
    "name": "معمل الحياة",
    "address": "دمياط الجديدة – باب الحرس",
    "phone1": "0572251661",
    "lat": "31.4436918",
    "long": "31.6810874",
    "phone2": "0",
    "phone3": "0"
  }
];
List md3=[
  {
    "name": "صيدليات ال عبد اللطيف الطرشوبى",
    "address": "الصفوة مول هادى مول دمياط.الهادي مول  المنطقة المركزية  دمياط الجديدة",
    "phone1": "19121",
    "lat": "31.4144124",
    "long": "31.7986923",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدليات دراهم",
    "address": "دمياط - امام الاستاد ميدان سرور",
    "phone1": "572232528",
    "lat": "31.41188",
    "long": "31.8085906",
    "phone2": "572245238",
    "phone3": "0"
  },
  {
    "name": "صيدليات دراهم",
    "address": "دمياط الجديدة  الحي الاول  بجوار هايبر المدينة",
    "phone1": "572232528",
    "lat": "31.4316115",
    "long": "31.6830461",
    "phone2": "572245238",
    "phone3": "0"
  },
  {
    "name": "صيدليات دراهم",
    "address": "دمياط  السنانية  طريق راس البر الجديد-راس البر 16 ش النيل",
    "phone1": "572232528",
    "lat": "31.5169116",
    "long": "31.8361603",
    "phone2": "572245238",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "صيدلية د/هثيم بصل",
    "address": "دمياط-السنانية-ش المدرسة-بجوار المجمع الإسلامي",
    "phone1": "01098518560",
    "lat": "31.422655",
    "long": "31.7829558",
    "phone2": "0",
    "phone3": "0",
    "undefined": "0"
  }
];
List md4=[
  {
    "name": "عيادة الوسام للاسنان",
    "address": "دمياط الجديده اعلى صيدليه الدياسطى بجوار مسجد المدينه نهايه الصعيدى",
    "phone1": "1111867644",
    "lat": "31.4459059",
    "long": "31.6829813",
    "phone2": "1024216206",
    "phone3": "0"
  },
  {
    "name": "د / محمد ابو اليزيد",
    "address": "امام البوابة الرئيسة لنادي المستقبل دمياط الجديدة",
    "phone1": "572417111",
    "lat": "31.4127768",
    "long": "31.7407387",
    "phone2": "572350727",
    "phone3": "1033005010"
  },
  {
    "name": "د / عبد العليم بدراوى",
    "address": "33 ش الكفراوى أعلي صيدلية الزيات دمياط الجديدة",
    "phone1": "1005680707",
    "lat": "31.4447897",
    "long": "31.6806915",
    "phone2": "1005680707",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "د / هانى اللبان",
    "address": "شارع الجلاء امام النيل للصرافة ( برج الهنا )",
    "phone1": "572204000",
    "lat": "31.4179805",
    "long": "31.8184524",
    "phone2": "0",
    "phone3": "0"
  }
{
    "name": "د / رضا سلامة الديك",
    "address": "دمياط-خلف السنترال الجديد كورنيش النيل أعلي صيدلية (محمد الأتربي)",
    "phone1": "01099772289",
    "lat": "31.4112771",
    "long": "31.7133495",
    "phone2": "0",
    "phone3": "0"
  }
];
List md5= [
  {
    "name": "ا . د الحسينى شريف",
    "address": "شارع الصعيدي  بجوار صيدلية الحول- دمياط الجديدة",
    "phone1": "572326609",
    "lat": "31.4218017",
    "long": "31.705231",
    "phone2": "572404142",
    "phone3": "0"
  }
];
List md6=[
  {
    "name": "ا.د/ اشرف طلعت",
    "address": "ش الجلاء بجوار عمارة الاوقاف اعلى صيدلية زغلول",
    "phone1": "572377844",
    "lat": "30.0596984",
    "long": "31.0730672",
    "phone2": "1222814161",
    "phone3": "0"
  },
  {
    "name": "د/ السيد ابو زيد ابراهيم",
    "address": "السنانية مطلع الكوبري العلوي –بجوار محروس للسيارات –اعلي صيدلية د.رفعت",
    "phone1": "1069310856",
    "lat": "30.7433069",
    "long": "30.8914058",
    "phone2": "1019359366",
    "phone3": "0"
  },
  {
    "name": "د/  السيد المغاوري",
    "address": "دمياط الجديدة –شارع الصعيدي –بجوار صيدلية الحول",
    "phone1": "1227885086",
    "lat": "31.4423665",
    "long": "31.683659",
    "phone2": "0",
    "phone3": "0"
  }
];
List md7= [
  {
    "name": "د / وليد البلاط",
    "address": "دمياط الجديدة امام مواقف دمياط",
    "phone1": "1002930046",
    "lat": "31.4423125",
    "long": "31.6823196",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "د / صلاح الشطورى",
    "address": "دمياط الجديدة –المنطقة المركزية –امام البنك الاهلي",
    "phone1": "1002376223",
    "lat": "31.4389646",
    "long": "31.6793339",
    "phone2": "1090318282",
    "phone3": "0"
  },
  {
    "name": "مركز نجم للعلاج الطبيعي",
    "address": "دمياط الجديدة –المنطقة المركزية - خلف سيتي جراند مول امام قصر الثقافة",
    "phone1": "1004007823",
    "lat": "31.4370173",
    "long": "31.67565",
    "phone2": "572400702",
    "phone3": "0"
  }
];
List md8= [
  {
    "name": "مستشفى دار العيون",
    "address": "ش المحجوب دمياط الجديدة –بجوار بنك مصر",
    "phone1": "1002930046",
    "lat": "31.4372324",
    "long": "31.6794096",
    "phone2": "0",
    "phone3": "0"
  }
];
List mn0=[
  {
    "name": "مستشفى الجزيرة الدولى- السلاب",
    "address": "جزيرة الورد- برج السلاب",
    "phone1": "502208557",
    "lat": "31.0452166",
    "long": "31.3633561",
    "phone2": "0",
    "phone3": "502208568"
  },
  {
    "name": "مستشفي المنصورة العسكري",
    "address": "مينة سندوب-الدقهلية",
    "phone1": "0502242474",
    "lat": "31.0203228",
    "long": "31.3938312",
    "phone2": "0",
    "phone3": "0"
  }
];
List mn2=[
  {
    "name": "معمل المختبر",
    "address": "ش- الجمهورية بجوار بنك مصر",
    "phone1": "502218448",
    "lat": "31.0472974",
    "long": "31.3816359",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "1 ش الجلاء –امام بوابة الجامعة",
    "phone1": "19911",
    "lat": "31.0408757",
    "long": "31.3620176",
    "phone2": "0",
    "phone3": "504060201"
  }
];
List mn3= [
  {
    "name": "مركز الايمان للاشعة",
    "address": "المنصورة امام البوابة الخلفية للمستشفى العام",
    "phone1": "502504009",
    "lat": "31.0443813",
    "long": "31.3914827",
    "phone2": "1020913532",
    "phone3": "1277665308"
  },
  {
    "name": "مركز تكنوسكان للاشعة التشخيصية",
    "address": "ميدان الهابي لاند- محمد صبري ابو علم",
    "phone1": "19989",
    "lat": "31.0476357",
    "long": "31.3859655",
    "phone2": "0",
    "phone3": "502327152"
  }
];
List mp0=[
  {
    "name": "المستشفى العسكري ببورسعيد",
    "address": "ش 23 يوليو أمام المتحف الحربي",
    "phone1": "663221676",
    "lat": "31.2686817",
    "long": "32.2974135",
    "phone2": "0",
    "phone3": "0"
  }
];
List mp1=[
  {
    "name": "عيادة كايرو كابيتال  للاسنان",
    "address": "شارع الجيش –اعلي خير زمان ماركت",
    "phone1": "1097770870",
    "lat": "31.262379",
    "long": "32.3067421",
    "phone2": "0",
    "phone3": "663334400"
  }
];
List mp2=[
  {
    "name": "معمل المختبر",
    "address": "برج سندس - امام مستشفي النصر –حي الزهور",
    "phone1": "19014",
    "lat": "31.2555483",
    "long": "32.281025",
    "phone2": "0",
    "phone3": "663244565"
  },
  {
    "name": "معمل المختبر",
    "address": "بورفؤاد 42 ش الشعراوي مدخل 3 -امام مسجد الشعراوي",
    "phone1": "663659659",
    "lat": "31.2387424",
    "long": "32.3180368",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "عمارة الرباط ش التعمير بجوار حي الضواحي",
    "phone1": "19911",
    "lat": "31.2506541",
    "long": "32.2819583",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معمل البرج",
    "address": "رئيسي 11، بور فؤاد، بور سعيد",
    "phone1": "663459336",
    "lat": "31.2387424",
    "long": "32.3180368",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "سيتى لاب",
    "address": "ش صلاح سالم برج الاطباء ارض العزب شارع النصر",
    "phone1": "1288883318",
    "lat": "31.2387376",
    "long": "32.285206",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "معامل ميترا",
    "address": "18 شارع صفيه زغلول والجيش – الشرق بورسعيد",
    "phone1": "01000070690",
    "lat": "31.2577285",
    "long": "32.3052046",
    "phone2": "0ا",
    "phone3": "0"
  }
];
List mp3=[
  {
    "name": "مركز الايمان للاشعة",
    "address": "حي الزهور - بورسعيد",
    "phone1": "0663342519",
    "lat": "31.2579632",
    "long": "32.3008272",
    "phone2": "0",
    "phone3": "0"
  }
];
List ms0=[
  {
    "name": "مستشفي السويس العسكري",
    "address": "طريق السويس السويس",
    "phone1": "01022784166",
    "lat": "29.9978677",
    "long": "32.486009",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "مستشفى د/ نظمى",
    "address": "2 ش عبد السلام عارف",
    "phone1": "623340400",
    "lat": "29.9672203",
    "long": "32.5520292",
    "phone2": "623340300",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "مستشفى القنال",
    "address": "برج الدوشي الدرو الثالث – امام بنك اسكندرية -السويس",
    "phone1": "1000297200",
    "lat": "29.9672433",
    "long": "32.5454631",
    "phone2": "623300833",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "مستشفى ابن سينا",
    "address": "8 ش السكة الحديد -  الملاحة",
    "phone1": "623333225",
    "lat": "29.966158",
    "long": "32.5390413",
    "phone2": "623333224",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "المركز الطبي للعاملين بقطاع البترول بالسويس",
    "address": "ش صلاح نسيم – طريق الزيتيات – بجور شركة السويس لتصنيع البترول",
    "phone1": "623365117",
    "lat": "29.9582298",
    "long": "32.5046074",
    "phone2": "623365116",
    "phone3": "623361603",
    "undefined": "0"
  },
  {
    "name": "مستشفى قناة السويس التخصصي",
    "address": "الملاحة الجديدة – المحروسة",
    "phone1": "1065111149",
    "lat": "29.9660805",
    "long": "32.5379312",
    "phone2": "623432477",
    "phone3": "1065111148",
    "undefined": "0"
  },
  {
    "name": "مستشفى الامل",
    "address": "56ش بنك مصر السويس",
    "phone1": "623337320",
    "lat": "30.0119425",
    "long": "31.3103403",
    "phone2": "0",
    "phone3": "623335496"
  },
 {
    "name": "مستشفى عين الحياة",
    "address": "5 شارع الفردوس-بجوار حي السويس-السويس",
    "phone1": "01273256444",
    "lat": "29.9644131",
    "long": "32.5581735",
    "phone2": "0",
    "phone3": "0"
  }
];
List ms1=[
  {
    "name": "المركز المصري للعلاج الطبيعي",
    "address": "ش الجيش الرئيسي ميدان الترعة برج البطل – بجوار مستشفى عباد الرحمن",
    "phone1": "1092990766",
    "lat": "29.9778418",
    "long": "32.5422363",
    "phone2": "0",
    "phone3": "1204547747",
    "undefined": "0"
  },
  {
    "name": "مركز كيور للعلاج الطبيعي",
    "address": "حي السويس- 45ش عدلي يكن خلف بريد السويس",
    "phone1": "1062828102",
    "lat": "29.9665011",
    "long": "32.553608",
    "phone2": "623358601",
    "phone3": "0"
  }
];
List ms2=[
  {
    "name": "معمل المختبر",
    "address": "23يوليو-السويس",
    "phone1": "19014",
    "lat": "29.9675375",
    "long": "32.5513639",
    "phone2": "0",
    "phone3": "0",
    "undefined": "0"
  },
  {
    "name": "معمل البرج",
    "address": "ش363 23 يوليو",
    "phone1": "19911",
    "lat": "29.9648736",
    "long": "32.5533003",
    "phone2": "null",
    "phone3": "."
  }
];
List ms3= [
  {
    "name": "صيدلية الحرية",
    "address": "ش الشهداء بجوار السنترال",
    "phone1": "623221224",
    "lat": "30.0206893",
    "long": "31.2941597",
    "phone2": "0",
    "phone3": "0"
  },
  {
    "name": "صيدلية الفؤاد",
    "address": "15 شارع مدرسة هلال من احمد عرابي",
    "phone1": "1206300031",
    "lat": "29.977178",
    "long": "32.541239",
    "phone2": "0",
    "phone3": "0"
  }
];
List ms4=[
  {
    "name": "مركز اليوسف للاشعة",
    "address": "ش  خالد بن الوليد",
    "phone1": "623334205",
    "lat": "29.9684013",
    "long": "32.5477645",
    "phone2": "0",
    "phone3": "0"
  }
];
}